Revit 2026 API

# RebarShapeConstraintProjectedSegmentLength Properties

---

The RebarShapeConstraintProjectedSegmentLength type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Direction | A vector specifying the direction of the constraint. The direction is fixed, and the shape is always constructed so that the segment direction has a positive dot product with this vector. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint) |
|  | TripleProductSign | Sign of the z-coordinate of the cross product of the Direction property with the segment vector. TripleProductSign is 1 if the segment direction is to be on the left of the constraint direction, or -1 if the segment direction is to be on the right. |

#### Reference

RebarShapeConstraintProjectedSegmentLength Class

Autodesk.Revit.DB.Structure Namespace